---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleHeadDiameter
source: html/9ae2691a-1aeb-6c1e-9f34-914c40bcc899.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleHeadDiameter Property

"Head diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleHeadDiameter { get; }
```